{
  "CAR": [
    {
      "name": "Bodong Festival",
      "location": "Kalinga",
      "date": "February 3 to 23",
      "image_path": "./assets/car/bodong_festival.png",
      "paragraphs": [
        "The Bodong Festival in Kalinga, Philippines, celebrates the ancient Bodong peace pact, an indigenous system for conflict resolution and inter-tribal alliances, highlighting Kalinga's rich culture through traditional music (gongs), dances (Banga dance), rituals, and unity. It serves as a vibrant showcase of cultural heritage, promoting harmony, resilience, and identity among the different iKalinga tribes, often featuring large-scale cultural performance and world record attempts."
      ]
    },
    {
      "name": "Kawayan Festival",
      "location": "Abra",
      "date": "March 9",
      "image_path": "./assets/car/kawayan_festival.png",
      "paragraphs": [
        "The Kawayan Festival celebrates bamboo, a vital resource for livelihood and culture, in several Philippine towns like Alegria (Cebu) and Mlang (Cotabato), and the entire province of Abra, symbolizing strength, flexibility, and local ingenuity through bamboo crafts, costumes, and parades, marking significant dates like town anniversaries or patron saint feasts (e.g., Abra's March 9th foundation day)."
      ]
    },
    {
      "name": "Panagbenga Festival",
      "location": "Baguio City",
      "date": "February 1 to March 2",
      "image_path": "./assets/car/panagbenga_festival.png",
      "paragraphs": [
        "The Panagbenga Festival rooted in Baguio City's recovery from teh devastating 1990 Luzon earthquake, starting in 1995 as a simple flower show to uplift spirits and boost tourism, evolving into a month-long celebration of blooming flowers and Cordilleran culture, named \"Panagbenga\" (season of blooming) to symbolize resillience, community, and the city's natural beauty. It features grand floral floats, street dancing inspired by the Bendian dance, and celebrates the region's flowers and vibrant spirit."
      ]
    }
  ],
  "NCR": [
    {
      "name": "Bambino Festival",
      "location": "Pasig",
      "date": "Third Sunday of January",
      "image_path": "./assets/ncr/bambino_festival.png",
      "paragraphs": [
        "The Bambino Festival is Pasig City's vibrant celebration honoring Sto. Niño (Child Jesus), a key religious festival in the Philippines, similar to Cebu's Sinulog or Iloilo's Dinagyang, focusing on the child's purity, love, and strength, featuring grand parades with devotees bringing their Sto. Niño images, cultural performances, and exhibits to express faith and community unity.",
        "Like other Sto. Niño festivals, it stems from the production of Christianity in the Philippines, particularly the devotion to the image of the Child Jesus gifted by Ferdinand Magellan in 1521.",
        "It serves as a spiritual and cultural experience, drawing families together and highlighting Christian values like love, mercy, and purity."
      ]
    },
    {
      "name": "Feast Day of San Juan",
      "location": "San Juan",
      "date": "June 24",
      "image_path": "./assets/ncr/feast_day_of_san_juan.png",
      "paragraphs": [
        "The Feast Day of San Juan (Saint John the Baptist) on June 24th celebrates his birth, marking a significant Christian event and blending with ancient pagan solstice traditions, featuring bonfires, feasting, and water rituals for purification, especially in Hispanic cultures, with traditions like backward plunges in Puerto Rico or mud-covered \"Taong Putik\" in the Philippines, all symbolizing cleansing, renewal, and preparing the way for the Lord."
      ]
    },
    {
      "name": "Feast of the Black Nazarene",
      "location": "Manila",
      "date": "9th of January",
      "image_path": "./assets/ncr/feast_of_the_black_nazarene.png",
      "paragraphs": [
        "The <strong>Feast of the Black Nazarene</strong> commemorates the transfer of a dark wooden statue of Jesus Christ to its home in Quiapo Church. The image was originally brought from Mexico in 1606 by Augustinian Recollect friars and was initially housed in Bagumbayan (now Luneta), then moved to an Intramuros church before its final relocation to Quiapo. The feast is celebrated with a massive procession called the <em>Traslacion</em>, which draws millions of devotees annually.\n<ul><li><b>1606</b>: The image of the Black Nazarene was brought to the Philippines from Mexico by Augustinian Recollect friars.</li><li><b>1608</b>: The image was moved from its initial location at St. John the Baptist Church in Bagumbayan to the Recollects' church in Intramuros.</li><li><b>1621</b>: The <i>Cofradia de Jesus Nazareno</i>, or the Confraternity of Jesus Nazarene, was founded.</li><li><b>1767</b>: On January 9, Manila Archbishop Basilio Sancho de Santas Justa y Rufina ordered the transfer of the image to Quiapo Church. This event is commemorated annually as the <i>Translacion</i>.</li><li><b>1787</b>: The image was canonically installed at Quiapo Church, which became known as the Minor Basilica of the Black Nazarene.</li><li><b>Later events</b>: The image has survived numerous fires and earthquakes, further cementing its miraculous status for devotees. The devotion continues to grow, with the annual feast becoming one of the largest displays of religious fervor in the world.</li></ul>"
      ]
    }
  ],
  "Region I": [
    {
      "name": "Bac-Bacarra Festival",
      "location": "Bacarra, Ilocos Norte",
      "date": "November 30",
      "image_path": "./assets/region_i/bac_bacarra_festival.png",
      "paragraphs": [
        "The Bac-Bacarra Festival in Bacarra, Ilocos Norte, Philippines, is a vibrant cultural celebration honoring their patron saint, St. Andrew the Apostle, showcasing local heritage, traditions, and agriculture through music, colorgul dances (like the Dance Parade), and thanksgiving, keeping ancestral stories alive for new generations. It's a community event designed to boost local identity and pride, celebrating the farmers and rich culture of Bacarra."
      ]
    },
    {
      "name": "Guling-Guling Festival",
      "location": "Paoay, Ilocos Norte",
      "date": "Late February to Early March",
      "image_path": "./assets/region_i/guling_guling_festival.png",
      "paragraphs": [
        "The Guling-Guling Festival in Paoay, Ilocos Norte, Philippines, is a vibrant pre-Lenten tradition blending Spanish Catholic influence with indigenous Ilocano culture, centered on symbolic cleansing through forehead markings with white rice flour (Guling means \"to smear/mark\") before Lent, symbolizing purity and sin removal, featuring folk dances, music, and communal feasting, highlighting local heritage and unity for over 400 years."
      ]
    },
    {
      "name": "Pamulinawen Festival",
      "location": "Laoag City",
      "date": "February 10",
      "image_path": "./assets/region_i/pamulinawen_festival.png",
      "paragraphs": [
        "The Pamulinawen Festival in Laoag City, Ilocos Norte celebrates the city's patron saint, St. William the Hermit, and its rich Ilocano culture, evolving from a simple feast day into a month-long event with street dancing, parades (including kalesa), culture shows, and trade fairs, named after the popular Ilocano folk song about a modest courtship. It highlights Ilocano heritage, promotes tourism, and fosters community pride through vibrant displays of tradition, music, and local life, starting in early February."
      ]
    }
  ],
  "Region II": [
    {
      "name": "Bambanti Festival",
      "location": "Isabela",
      "date": "January 19 to 25",
      "image_path": "./assets/region_ii/bambanti_festival.png",
      "paragraphs": [
        "The Bambanti Festival in Isabela, Philippines started in 1997 under Governor Benjamin Dy to celebrate the province's rich agricultural heritage, using the \"bambanti\" (scarecrow) as its symbol for farmers' hard work and resilience, evolving into a huge annual event with giant scarecrows, street dances, pageants, and cultural showcases from all 34 municipalities."
      ]
    },
    {
      "name": "Cabibi Festival",
      "location": "Lal-lo, Cagayan",
      "date": "August 1-4",
      "image_path": "./assets/region_ii/cabibi_festival.png",
      "paragraphs": [
        "The Cabibi Festival in Lal-lo, Cagayan, celebrates the town's rich history as oen of the first Spanish-established cities, honoring its indigenous culture (linked to \"cabibi\" shells) and religious roots (Sto. Domingo de Guzman) with vibrant street dancing, cultural shows, and trade fairs, blending indigenous traditions with Christianity and emphasizing community unity and bounty from the river. It marks a transition from paganism to faith and showcase local culture through festive events, evolving to include modern themes like environmental care."
      ]
    },
    {
      "name": "Higalaay Festival",
      "location": "Cagayan de Oro City (CDO)",
      "date": "August 28",
      "image_path": "./assets/region_ii/higalaay_festival.png",
      "paragraphs": [
        "The Higalaay Festival in Cagayan de Oro evolved from a small religious celebration honoring the feast of St. Augustine, which began around the 18th century. It was formerly known as the Kagay-an Festival and is now officially called Higalaay Festival to reflect the city's identity as the \"City of Golden Friendship\", with \"higala\" meaning friend. The festival grew from its religious roots into a large, vibrant celebration showcasing community pride, unity, and friendship."
      ]
    }
  ],
  "Region III": [
    {
      "name": "Giant Lantern Festival",
      "location": "San Fernando, Pampanga",
      "date": "Mid-December to early January",
      "image_path": "./assets/region_iii/giant_lantern_festival.png",
      "paragraphs": [
        "The Giant Lantern Festival (Ligligan Parul) in San Fernando, Pampanga is a dazzling annual Christmas event showcasing Filipino artistry with giant, intricate lanterns that light up the night, evolving from simple candle-lit paper crafts into elaborate, electric displays by competing villages, symbolizing the Star of Bethlehem and bringing hope."
      ]
    },
    {
      "name": "Makatapak Festival",
      "location": "Bacolor, Pampanga",
      "date": "November 14",
      "image_path": "./assets/region_iii/makatapak_festival.png",
      "paragraphs": [
        "The Makatapak Festival in Bacolor, Pampanga commemorates the town's resilience after the devastating lahar flows from Mt. Pinatubo (1991-1995), with \"Makatapak\" meaning \"barefoot\" in Kapampangan, symbolizing the people's journey through the ash-covered town. Celebrated during the town fiesta in November, it's a vibrant cultural event featuring street dancing, cultural performances, and reenactments that honor the community's faith, strength, and spirit."
      ]
    },
    {
      "name": "Pahiyas Festival",
      "location": "Lucban, Quezon Province",
      "date": "May 15",
      "image_path": "./assets/region_iii/pahiyas_festival.png",
      "paragraphs": [
        "The Pahiyas Festival originated in the 16th century as a thanksgiving ceremony for farmers in Lucban, Quezon to honor San Isidro Labrador, the patron saint of farmers, for a bountiful harvest. It began with farmers bringing produce ot the church for blessings, but this practice evolved as the church could no longer accomodate the large amount of harvest. Today, it is an annual celebration on May 15 where residents decorate their homes with colorful, edible decorations made of fruits, vegetables, and kiping (rice wafers)."
      ]
    }
  ],
  "Region IV-A": [
    {
      "name": "Higante Festival",
      "location": "Angono, Rizal",
      "date": "November 22 and 23",
      "image_path": "./assets/region_iv_a/higante_festival.png",
      "paragraphs": [
        "The Higantes Festival in Angono, Rizal celebrates San Clemente with giant papier-mache puppets (higantes) paraded during the town fiesta, originating from Spanish colonial times as a subtle protest by locals against strict landlords by mocking them with the large figures, evolving from resistance to a vibrant cultural expression of community spirit, artistic skill, and gratitude for abundant fish from Laguna Bay."
      ]
    },
    {
      "name": "Bangkero Festival",
      "location": "Pagsanjan, Laguna",
      "date": "March 19 to March 22",
      "image_path": "./assets/region_iv_a/bangkero_festival.png",
      "paragraphs": [
        "The Bangkero Festival in Pagsanjan, Laguna celebrates the town's skilled boatmen (bangkeros) who navigate the famous Pagsanjan River, highlighting local culture, tourism (especially Pagsanjan Falls), and community spirit through boat races (regatta), fluvial parades, cultural street dancing, and trade fairs, honoring these river heroes and promoting Pagsanjan's heritage and local delicacies."
      ]
    },
    {
      "name": "Pili Festival",
      "location": "Sorsogon City",
      "date": "June 29th",
      "image_path": "./assets/region_iv_a/pili_festival.png",
      "paragraphs": [
        "The Pili Festival in Sorsogon, Philippines is a vibrant cultural and religious celebration in June, centered on the indigenous pili nut, highlighting its economic importance and the region's rich harvest, coinciding with the feast of Saints Peter and Paul, and featuring parades, competitions, and cultural showcases. Conceptualized in 1999, it brings together faith, community, and the unique pili tree that defines Sorsogon's way of life."
      ]
    }
  ],
  "Mimaropa": [
    {
      "name": "Moriones Festival",
      "location": "Marinduque",
      "date": "April 14 to 20",
      "image_path": "./assets/mimaropa/moriones_festival.png",
      "paragraphs": [
        "The Moriones Festival in Marinduque, Philippines started in the 1870s/1880s, initiated by Fr. Dionisio Santiago in Mogpog, to teach the Passion of Christ during Holy Week. It's named for the \"Moriones\" (Roman soldiers in morrion helmets) who re-enact the story of St. Longinus, a centurion miraculously healed by Christ's blood, leading to his conversion and martyrdom. The festival involves penitents (\"Morions\") wearing elaborate masks and costumes, roaming streets from Holy Monday to Easter Sunday, seeking Longinus, and performing acts of penance (panata)."
      ]
    },
    {
      "name": "Bila-Bila Festival",
      "location": "Boac, Marinduque",
      "date": "May 16 to 23",
      "image_path": "./assets/mimaropa/bila_bila_festival.png",
      "paragraphs": [
        "The Bila-Bila Festival (Butterfly Festival) in Marinduque, Philippines celebrates the province's rich butterfly diversity, showcasing it as the \"Butterfly Capital of the Philippines\" through vibrant parades with kids in colorful costumes, butterfly-themed performances, and activities promoting environmental conservation and the local butterfly farming industry, serving as a cultural event for heritage, tourism, and education."
      ]
    },
    {
      "name": "Baragatan Festival",
      "location": "Palawan",
      "date": "June 17 to 23",
      "image_path": "./assets/mimaropa/baragatan_festival.png",
      "paragraphs": [
        "The Baragatan Festival in Palawan, held annually around June 17 to 23, celebrates the province's founding, with \"Baragatan\" meaning \"to meet\" in Cuyunon, symbolizing unity and the convergence of its diverse cultures through street dances, trade fairs (Barakalan), and cultural shows, showcasing local products, and fostering community spirit."
      ]
    }
  ],
  "Region V": [
    {
      "name": "Ibalong Festival",
      "location": "Legazpi City, Albay",
      "date": "August 21 to September 6",
      "image_path": "./assets/region_v/ibalong_festival.png",
      "paragraphs": [
        "The Ibalong Festival is rooted in the Ibalong Epic, a Bicolano folk epic that tells the story of the ancient region of Ibalon. The festival celebrates three legendary heroes -- Baltog, Handyong, and Bantong -- who battled mythical beasts and monsters to protect their homeland. It is a non-religious festival held annually in Legazpi City, Albay to showcase Bicolano identity and culture."
      ]
    },
    {
      "name": "Peñafrancia Festival",
      "location": "Naga City, Camarines Sur",
      "date": "Third Sunday of September",
      "image_path": "./assets/region_v/penafrancia_festival.png",
      "paragraphs": [
        "The Peñafrancia Festival began with a Spanish priest, Fr. Miguel Robles de Covarrubias, who brought the devotion to Our Lady of Peñafrancia to the Philippines in the early 18th century after being miraculously healed. Inspired by the image's reported miracles, the devotion in the Bicol region, especially in Naga City, grew rapidly and became a significant cultural and religious event. The tradition is now a month-long celebration highlighted by the solemn Traslacion and Fluvial Processions, where the image is moved and then returned to the Minor Basilica of Our Lady of Peñafrancia."
      ]
    },
    {
      "name": "Kaogma Festival",
      "location": "Camarines Sur",
      "date": "May 23 to 28",
      "image_path": "./assets/region_v/kaogma_festival.png",
      "paragraphs": [
        "The Kaogma Festival, meaning \"a good time\", is Camarines Sur's (CamSur) grand annual celebration marking the province's foundation day (May 27) since 1989, evolving from a small event to the \"World's Hottest Festival\" with vibrant street parties, concerts, sports, arts, and cultural shows like the Miss Kaogma pageant, showcasing CamSur's culture, faith, and people to attract tourists and boost local economy."
      ]
    }
  ],
  "Region VI": [
    {
      "name": "Dinagyang Festival",
      "location": "Iloilo City",
      "date": "Fourth Sunday of January",
      "image_path": "./assets/region_vi/dinagyang_festival.png",
      "paragraphs": [
        "The Dinagyang Festival in Iloilo City has rooted in the reverence for the Holy Child Jesus (Santo Niño) and the commemoration of the Barter of Panay. It began in 1967 and was inspired by the Ati-atihan Festival, with a replica of the Santo Niño first brought to the city, sparking local celebrations that evolved into the grand annual event it is today. The festival's name, \"Dinagyang\", is a Hiligaynon word for \"merrymaking\"."
      ]
    },
    {
      "name": "MassKara Festival",
      "location": "Bacolod City",
      "date": "October 17 to 19",
      "image_path": "./assets/region_vi/masskara_festival.png",
      "paragraphs": [
        "The MassKara Festival started in Bacolod City in 1980 during a severe economic crisis due to the sugar price crash and a tragic ferry disaster, prompting officials to create a \"festival of smiles\" using masks to uplift spirits and showcase resilience and optimism. Named for \"mask\" (massa) and \"laughter\" (kara), it features vibrant street dancing, colorful masks with smiling faces, parades, and competitions, transforming Bacolod into the \"City of Smiles\" and becoming a major cultural and tourism event."
      ]
    },
    {
      "name": "Ati-Atihan Festival",
      "location": "Kalibo, Aklan",
      "date": "Third Sunday of January",
      "image_path": "./assets/region_vi/ati_atihan_festival.png",
      "paragraphs": [
        "The Ati-Atihan Festival in Kalibo, Aklan began in the 13th century as a pagan celebration of peace between indigenous Aetas and Malay settlers from Borneo, who blackened their faces with soot to honor the Atis' generosity and shared culture, later evolving into a Catholic feast for the Santo Niño (Infant Jesus), marked by tribal dances, drums, and shouts of \"Hala Bira!\"."
      ]
    }
  ],
  "Region VII": [
    {
      "name": "Sinulog Festival",
      "location": "Cebu City",
      "date": "Third Sunday of January",
      "image_path": "./assets/region_vii/sinulog_festival.png",
      "paragraphs": [
        "The Sinulog Festival is rooted in the 1521 arrival of Ferdinand Magellan in Cebu, who gifted a statue of the Santo Niño (Child Jesus) to the local chieftain's wife, Queen Juana. This gift marked the beginning of Christianity in the Philippines and is now celebrated as the Feast of the Santo Niño. The festival's name comes from the Cebuano word \"sulog\", meaninig \"like water current\", which describes the two-steps-forward, one-step-back motion of the traditional dance performed in honor of the Santo Niño."
      ]
    },
    {
      "name": "Sandugo Festival",
      "location": "Tagbilaran City, Bohol",
      "date": "July 22",
      "image_path": "./assets/region_vii/sandugo_festival.png",
      "paragraphs": [
        "The Sandugo Festival in Bohol, Philippines commemorates the 1565 blood compact (sandugo, meaning \"one blood\") between Datu Sikatuna of Bohol and Spanish conquistador Miguel Lopez de Legazpi, symbolizing a treaty of friendship and marking the start of Spanish colonization, celebrated annually in July with vibrant street dances, cultural shows, and reenactments highlighting this historic bond and Boholano heritage."
      ]
    },
    {
      "name": "Buglasan Festival",
      "location": "Dumaguete City, Negros oriental",
      "date": "October 16 to 26",
      "image_path": "./assets/region_vii/buglasan_festival.png",
      "paragraphs": [
        "The Buglasan Festival is Negros Oriental's premier \"Festival of Festivals\", named after \"Buglas\", the island's pre-Hispanic name, celebrating its rich culture in Dumaguete City every October by gathering all local town and city festivals into one grand event, showcasing unity, diversity, and heritage through vibrant street dances, cultural shows, and unique local traditions. Initiated in 1980/1981, it serves as a grand cultural summit, highlighting each municipality's unique festivities, arts, and traditions in a unified celebration."
      ]
    }
  ],
  "NIR": [
    {
      "name": "Panaad sa Negros Festival",
      "location": "Barangay Mansilingan, Bacolod City, Negros Occidental",
      "date": "First Week of April",
      "image_path": "./assets/nir/panaad_sa_negros_festival.png",
      "paragraphs": [
        "The Panaad sa Negros Festival, also called simply as the Panaad Festival, is a festival held annually during the month of April in Bacolod, the capital of Negros Occidental province in the Philippines. Panaad is the Hiligaynon word for \"vow\" or \"promise\" coming from the root-word \"saad\", the festival is a form of thanksgiving to Divine Providence and commemoration of a voew in exchange for a good life.",
        "The celebration is held at the Panaad Park, which also houses the Panaad Stadium, and is participated in by the 13 cities and 19 towns of the province. For this reason, the province dubs it the \"mother\" of all its festivals."
      ]
    },
    {
      "name": "Sandurot Festival",
      "location": "Dumaguete City, Negros Oriental",
      "date": "Fourth Week of September",
      "image_path": "./assets/nir/sandurot_festival.png",
      "paragraphs": [
        "The Sandurot Festival in Dumaguete City, Philippines celebrates the city's history, culture, and renowned hospitality (\"Sandurot\" means \"to fetch\" or \"to meet\"), showcasing its spirit of <i>paghugpong</i> (coming together) through vibrant street dancing and cultural showcases, honoring its heritage as the \"City of Gentle People\". It's a yearly event held in November, featuring colorful performances and artistic expression, inviting locals and tourists to experience Dumaguete's unique blend of tradition and community spirit."
      ]
    },
    {
      "name": "Tawo-Tawo Festival",
      "location": "Bayawan City",
      "date": "February 18",
      "image_path": "./assets/nir/tawo_tawo_festival.png",
      "paragraphs": [
        "The Tawo-Tawo Festival in Bayawan City, Negros Oriental celebrates the city's rich agricultural heritage, especially rice production, and honors its patron saint, Santo Tomas de Villanueva, as a thanksgiving for bountiful harvests, featuring colorful street dancing and cultural shows that symbolize resilience and community unity, initiated in 1986 by local civic groups and later adopted by the government."
      ]
    }
  ],
  "Region VIII": [
    {
      "name": "Pintados-Kasadyaan Festival",
      "location": "Tacloban City, Leyte",
      "date": "June 29",
      "image_path": "./assets/region_viii/pintados_kasadyaan_festival.png",
      "paragraphs": [
        "The Pintados-Kasadyaan Festival in Tacloban, Leyte celebrates the rich indigenous culture of the Visayas, honoring the ancient \"Pintados\" (painted ones) warriors known for their intricate tattoos, merging with the region's vibrant festival of festivals, Kasadyaan, on June 29th to honor the Santo Niño, showcasing cultural pride through body-painted dancers, folklore, and thanksgiving for harvests through grand parades."
      ]
    },
    {
      "name": "Buyogan Festival",
      "location": "Abuyog, Leyte",
      "date": "August 19",
      "image_path": "./assets/region_viii/buyogan_festival.png",
      "paragraphs": [
        "The Buyogan Festival in Abuyog, Leyte celebrates the town's name origin from the local bees (\"buyog\") with vibrant street dances mimicking bee movements, highlighting industriousness, resilience, and nature's importance, a tradition that gained national fame after winning the Aliwan Festival. It's a cultural showcase of Abuyog's history, featuring colorful dancers in tribal designs, emphasizing the bee's significance for ecology and health."
      ]
    },
    {
      "name": "Mayaw-Mayaw Festival",
      "location": "Pinabacdao, Samar",
      "date": "May 10",
      "image_path": "./assets/region_viii/mayaw_mayaw_festival.png",
      "paragraphs": [
        "The Mayaw-Mayaw Festival is a yearly thanksgiving festivity each tenth of May. The festival are featured with move and dramatization challenges, social introductions and road moving rivalry. The festival began as an aesthetic move that portrays an old custom amid the pre-Spanish time that is as yet being drilled in Pinabacdao and taken an interest by nearby agriculturists, schools, open gatherings and barangays.",
        "The custom is called \"mayaw\" or \"gamit\" in Waray joined by the enthusiastic beat of the drums and other privately made melodic instruments, for example, bamboo woodwinds. Amid time long past circumstances, it was performed by a \"tambalan\" which was accepted to be somebody with mending powers and can speak with the sould world, may it be great ot bad."
      ]
    }
  ],
  "Region IX": [
    {
      "name": "Zamboanga Hermosa Festival",
      "location": "Zamboanga City",
      "date": "October 12",
      "image_path": "./assets/region_ix/zamboanga_hermosa_festival.png",
      "paragraphs": [
        "The Zamboanga Hermosa Festival or (Fiesta Pilar) is a month-long cultural and religious celebration in Zamboanga CIty, Philippines held every October, honoring the city's patron saint, Nuestra Señora del Pilar (Our Lady of the Pillar), with the main feast day on October 12, featuring vibrant street dances, the Regatta de Zamboanga (sailboat races), and cultural shows blending indigenous, Spanish, and Muslim traditions, showcasing Zamboanga's rich heritage."
      ]
    },
    {
      "name": "Sibug-Sibug Festival",
      "location": "Ipal, Zamboanga Sibugay",
      "date": "February 24",
      "image_path": "./assets/region_ix/sibug_sibug_festival.png",
      "paragraphs": [
        "The Sibug-Sibug Festival celebrates the rich culture, history, and resources of Zamboanga Sibugay, named after the Sibuguey River, highlighting its vibrant marine life (especially oysters and seaweed), indigenous peoples, and the resilience of its early settlers, featuring colorful street dances, cultural presentations, and events like the long oyster grill to showcase local pride and economic vitality."
      ]
    },
    {
      "name": "Megayon Festival",
      "location": "Zamboanga del Sur",
      "date": "September 17",
      "image_path": "./assets/region_ix/megayon_festival.png",
      "paragraphs": [
        "The Megayon Festival is an annual cultural celebration in Zamboanga del Sur, Philippines showcasing the rich heritage and unity of its diverse peoples, especially the indigenous Subanen, Moro, and local settlers, through vibrant music, traditional dances, and performances during the province's founding anniversary (Arwa ng Zamboanga del Sur). It's a grand display of local artistry and tradition, emphasizing harmony and cultural pride."
      ]
    }
  ]
}